Oryx-Embedded/CycloneTCP/drivers/mac/stm32mp13xx_eth2_driver.c
/**
 * @file stm32mp13xx_eth2_driver.c
 * @brief STM32MP13 Gigabit Ethernet MAC driver (ETH2 instance)
 *
 * @section License
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 *
 * Copyright (C) 2010-2026 Oryx Embedded SARL. All rights reserved.
 *
 * This file is part of CycloneTCP Open.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software Foundation,
 * Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
 *
 * @author Oryx Embedded SARL (www.oryx-embedded.com)
 * @version 2.6.2
 **/

//Switch to the appropriate trace level
#define TRACE_LEVEL NIC_TRACE_LEVEL

//Dependencies
#include "stm32mp13xx.h"
#include "stm32mp13xx_hal.h"
#include "core/net.h"
#include "drivers/mac/stm32mp13xx_eth2_driver.h"
#include "debug.h"

//Underlying network interface
static NetInterface *nicDriverInterface;

//IAR EWARM compiler?
#if defined(__ICCARM__)

//Transmit buffer
#pragma data_alignment = 4
#pragma location = STM32MP13XX_ETH2_RAM_SECTION
static uint8_t txBuffer[STM32MP13XX_ETH2_TX_BUFFER_COUNT][STM32MP13XX_ETH2_TX_BUFFER_SIZE];
//Receive buffer
#pragma data_alignment = 4
#pragma location = STM32MP13XX_ETH2_RAM_SECTION
static uint8_t rxBuffer[STM32MP13XX_ETH2_RX_BUFFER_COUNT][STM32MP13XX_ETH2_RX_BUFFER_SIZE];
//Transmit DMA descriptors
#pragma data_alignment = 8
#pragma location = STM32MP13XX_ETH2_RAM_SECTION
static Stm32mp13xxEth2TxDmaDesc txDmaDesc[STM32MP13XX_ETH2_TX_BUFFER_COUNT];
//Receive DMA descriptors
#pragma data_alignment = 8
#pragma location = STM32MP13XX_ETH2_RAM_SECTION
static Stm32mp13xxEth2RxDmaDesc rxDmaDesc[STM32MP13XX_ETH2_RX_BUFFER_COUNT];

//GCC compiler?
#else

//Transmit buffer
static uint8_t txBuffer[STM32MP13XX_ETH2_TX_BUFFER_COUNT][STM32MP13XX_ETH2_TX_BUFFER_SIZE]
   __attribute__((aligned(4), __section__(STM32MP13XX_ETH2_RAM_SECTION)));
//Receive buffer
static uint8_t rxBuffer[STM32MP13XX_ETH2_RX_BUFFER_COUNT][STM32MP13XX_ETH2_RX_BUFFER_SIZE]
   __attribute__((aligned(4), __section__(STM32MP13XX_ETH2_RAM_SECTION)));
//Transmit DMA descriptors
static Stm32mp13xxEth2TxDmaDesc txDmaDesc[STM32MP13XX_ETH2_TX_BUFFER_COUNT]
   __attribute__((aligned(8), __section__(STM32MP13XX_ETH2_RAM_SECTION)));
//Receive DMA descriptors
static Stm32mp13xxEth2RxDmaDesc rxDmaDesc[STM32MP13XX_ETH2_RX_BUFFER_COUNT]
   __attribute__((aligned(8), __section__(STM32MP13XX_ETH2_RAM_SECTION)));

#endif

//Current transmit descriptor
static uint_t txIndex;
//Current receive descriptor
static uint_t rxIndex;


/**
 * @brief STM32MP13 Ethernet MAC driver (ETH2 instance)
 **/

const NicDriver stm32mp13xxEth2Driver =
{
   NIC_TYPE_ETHERNET,
   ETH_MTU,
   stm32mp13xxEth2Init,
   stm32mp13xxEth2Tick,
   stm32mp13xxEth2EnableIrq,
   stm32mp13xxEth2DisableIrq,
   stm32mp13xxEth2EventHandler,
   stm32mp13xxEth2SendPacket,
   stm32mp13xxEth2UpdateMacAddrFilter,
   stm32mp13xxEth2UpdateMacConfig,
   stm32mp13xxEth2WritePhyReg,
   stm32mp13xxEth2ReadPhyReg,
   TRUE,
   TRUE,
   TRUE,
   FALSE
};


/**
 * @brief STM32MP13 Ethernet MAC initialization
 * @param[in] interface Underlying network interface
 * @return Error code
 **/

error_t stm32mp13xxEth2Init(NetInterface *interface)
{
   error_t error;
   uint32_t temp;

   //Debug message
   TRACE_INFO("Initializing STM32MP13 Ethernet MAC (ETH2)...\r\n");

   //Save underlying network interface
   nicDriverInterface = interface;

   //GPIO configuration
   stm32mp13xxEth2InitGpio(interface);

   //Enable Ethernet MAC clock
   __HAL_RCC_ETH2CK_CLK_ENABLE();
   __HAL_RCC_ETH2MAC_CLK_ENABLE();
   __HAL_RCC_ETH2TX_CLK_ENABLE();
   __HAL_RCC_ETH2RX_CLK_ENABLE();

   //Reset Ethernet MAC peripheral
   __HAL_RCC_ETH2MAC_FORCE_RESET();
   __HAL_RCC_ETH2MAC_RELEASE_RESET();

   //Perform a software reset
   ETH2->DMAMR |= ETH_DMAMR_SWR;
   //Wait for the reset to complete
   while((ETH2->DMAMR & ETH_DMAMR_SWR) != 0)
   {
   }

   //Adjust MDC clock range depending on HCLK frequency
   ETH2->MACMDIOAR = ETH_MACMDIOAR_CR_DIV124;

   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Ethernet PHY initialization
      error = interface->phyDriver->init(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Ethernet switch initialization
      error = interface->switchDriver->init(interface);
   }
   else
   {
      //The interface is not properly configured
      error = ERROR_FAILURE;
   }

   //Any error to report?
   if(error)
   {
      return error;
   }

   //Use default MAC configuration
   ETH2->MACCR = ETH_MACCR_GPSLCE | ETH_MACCR_DO;

   //Set the maximum packet size that can be accepted
   temp = ETH2->MACECR & ~ETH_MACECR_GPSL;
   ETH2->MACECR = temp | STM32MP13XX_ETH2_RX_BUFFER_SIZE;

   //Configure MAC address filtering
   stm32mp13xxEth2UpdateMacAddrFilter(interface);

   //Disable flow control
   ETH2->MACQ0TXFCR = 0;
   ETH2->MACRXFCR = 0;

   //Enable the first RX queue
   ETH2->MACRXQC0R = ETH_MACRXQC0R_RXQ0EN_Val(2);

   //Configure DMA operating mode
   ETH2->DMAMR = ETH_DMAMR_INTM_Val(0) | ETH_DMAMR_TXPR_Val(0);
   //Configure system bus mode
   ETH2->DMASBMR |= ETH_DMASBMR_AAL;

   //The DMA takes the descriptor table as contiguous
   ETH2->DMAC0CR = ETH_DMAC0CR_DSL_Val(0);
   //Configure TX features
   ETH2->DMAC0TXCR = ETH_DMAC0TXCR_TXPBL_Val(32);

   //Configure RX features
   ETH2->DMAC0RXCR = ETH_DMAC0RXCR_RXPBL_Val(32) |
      ETH_DMAC0RXCR_RBSZ_Val(STM32MP13XX_ETH2_RX_BUFFER_SIZE);

   //Enable store and forward mode for transmission
   ETH2->MTLTXQ0OMR = ETH_MTLTXQ0OMR_TQS_Val(7) | ETH_MTLTXQ0OMR_TXQEN_Val(2) |
      ETH_MTLTXQ0OMR_TSF;

   //Enable store and forward mode for reception
   ETH2->MTLRXQ0OMR = ETH_MTLRXQ0OMR_RQS_Val(7) | ETH_MTLRXQ0OMR_RSF;

   //Initialize DMA descriptor lists
   stm32mp13xxEth2InitDmaDesc(interface);

